# 07 - Menghapus (Drop) Missing Values (NaN) pada Data Frame

#Import Modules

Module yang digunakan :
1. pandas

In [1]:
import pandas as pd

-Mengecheck versi dari module yang digunakan yaitu pandas.

In [3]:
print(pd.__version__)

1.0.5

#Membuat Sebuah Data Frame yang Mengandung Missing Value

Untuk membuat sebuah data frame yang mengandung missing value, kita dapat memanfaatkan sebuah module yaitu pd.util.testing.makeMissingDataframe()

Method reset_index() digunakan untuk membentuk index baru. Index lamanya akan diadopsi sebagai sebuah kolom biasa.

Function df.head() akan menampilkan hanya 5 data pertama.

In [4]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

C:\Users\ASUS\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

        index         A         B         C         D
0  ZialyBgy68 -0.109448  0.641628 -0.465871  1.928671
1  brvUCwu89V  0.773227 -0.670162 -0.456000 -0.040757
2  JMIV7FnBsu -0.458238  1.290403  1.426894       NaN
3  KfK0GGW6gp  1.130287  0.187093  0.367217 -0.963102
4  CqBziRP7oF       NaN -0.769784 -1.524139  1.425866

#Mengubah nama kolom 'index' menjadi 'Z'

Untuk mengubah nama kolom, kita dapat menggunakan function rename() dengan parameter berupa columns yang berisikan dictionary.

In [5]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  ZialyBgy68 -0.109448  0.641628 -0.465871  1.928671
1  brvUCwu89V  0.773227 -0.670162 -0.456000 -0.040757
2  JMIV7FnBsu -0.458238  1.290403  1.426894       NaN
3  KfK0GGW6gp  1.130287  0.187093  0.367217 -0.963102
4  CqBziRP7oF       NaN -0.769784 -1.524139  1.425866

#Membuat copy dari data frame

Berikut ini kita akan melakukan copy dari data frame dan hasil copynya akan disimpan di variabel df_backup. Proses pengcopyan yang dilakukan adalah deep copy dengan parameternya yang bernilai True.

In [6]:
df_backup = df.copy(deep=True)

#Menghapus (Drop) Setiap Kolom yang Mengandung Missing Values.

Jika terdapat missing values pada suatu kolom, kolom tersebut akan dihapus.

Untuk menghapus kolom yang mengandung missing values, kita dapat memanggil df.dropna(axis='columns').

In [6]:
df = df.dropna(axis='columns') 
df.head()

            Z
0  79VcvKJ0qO
1  XuhQaHx1RN
2  Of7Zm2hkCV
3  f1tsahLNPe
4  H8vq6zm06Y

#Menghapus (Drop) Setiap Baris yang Mengandung Missing Values.

Jika terdapat missing values pada suatu baris, baris tersebut akan dihapus.

Sebelumnya kita perlu untuk mengembalikan kondisi data frame, dengan memanggil df_backup.copy(deep=True).

Untuk menghapus baris yang mengandung missing values, kita dapat memanggil df.dropna(axis='rows').

In [7]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  ZialyBgy68 -0.109448  0.641628 -0.465871  1.928671
1  brvUCwu89V  0.773227 -0.670162 -0.456000 -0.040757
3  KfK0GGW6gp  1.130287  0.187093  0.367217 -0.963102
5  0E4oSdzROn -0.148424 -0.350913 -0.292705  0.525516
7  uzVur8WnOD -1.635556  0.621451  0.741574  0.563051